[
  {
    "title": "Started freelancing and found my first clients, looking for advice on how to improve my workflow and offer",
    "author": "/u/essence_scape",
    "link": "https://www.reddit.com/r/Entrepreneur/comments/1qykv0m/started_freelancing_and_found_my_first_clients/",
    "published": "2026-02-07T18:09:18+00:00",
    "subreddit": "entrepreneur",
    "content": "Currently on a very exhilarating part of my journey, after much thinking and hesitation i decided to start my own freelance business. Before this point I've mostly work within the restaurant industry as a 9 to 5 food runner. Always been interested in programming/digital art and have taken a couple of courses in those fields.  About a month ago a colleague from the hotel i used to work at opened his own food truck which i am now working as a line cook helper, social media manager and web developer; wearing a lot of hats, i know. The previous months to him opening i decided to listen to his needs and write down what could i program or design that would help in his business. I developed his web page/online menu and a few dashboard tools for inventory, etc (mostly CRUD apps).  Turns out he has a 11k facebook following and knows A LOT of local businesses (produce suppliers, farmers, bars, restaurants, etc). Managing his social media has been a breeze thanks to this, i bit the bullet and decided to learn how to use meta ads which have worked really well for exposure and word of mouth for his business. He alway keeps an entrepeneur mindset and pep talks me into his whole vision of running a franchise of his brand and me being there along side him.  I'm only working with him 14 hours a week but thanks to the good relationship i've gotten about 4 leads in the first month of working with him and have developed my own workflow i can replicate with my next clients. One of the leads turned into a monthly subscriber client whose local business is about 3 minutes from my house, take in consideration we are in Puerto Rico, really small island, everyone knows everyone and all the local business are outdated in terms of tech resources and missing out on all the typical solutions any business should have (google business, meta ads, domain and professional email, etc).  while i am self taught in all these soft skills and this is the first time i'm executing them in real case scenarios, i feel my value and offer are a bit broad. i'm trying to nail a workflow that streamlines the process of what i will focus on or maybe a plan on how to price it. The closest thing i've found to what i do is brand strategy.  my typical workflow is something like: pro bono meeting to discuss and audit the client's business. what are they using, what do they want to achieve, what tools do i have or can create to improve weak areas, etc. then weekly meetings once on a monthly retainer plan to discuss that week's deliverable and progress. i got two audit meetings for this month, and not sure what part of my offer i should focus, keep, or eliminate. monthly pricing is something else i would love to discuss or what model is actually best for this stage. Any books, help, advice, videos, or feedback is highly appreciated. It has been a bit overwhelming reaching this point but i feel energized. Thanks for taking a read on this long post.     submitted by    /u/essence_scape   [link]   [comments]",
    "score": 2,
    "matched_keywords": [
      "streamline",
      "workflow"
    ]
  },
  {
    "title": "Is anyone actually seeing good recovery rates with just automated emails?",
    "author": "/u/Plus_Cockroach2896",
    "link": "https://www.reddit.com/r/Entrepreneur/comments/1qye4fr/is_anyone_actually_seeing_good_recovery_rates/",
    "published": "2026-02-07T13:42:34+00:00",
    "subreddit": "entrepreneur",
    "content": "I’ve been analyzing some Shopify data and it feels like the standard 'Abandoned Cart' automated emails are getting lower open rates this year. I've been experimenting with the idea of 'Manual Recovery' (actually reaching out to high-value carts personally or via chat). Has anyone here tried moving away from full automation to a more human-led support approach? Would love to know if the conversion lift is worth the extra effort.    submitted by    /u/Plus_Cockroach2896   [link]   [comments]",
    "score": 2,
    "matched_keywords": [
      "automate",
      "automation"
    ]
  }
]